---
kind: other
id: Methods.T:Autodesk.Revit.DB.Events.DocumentOpeningEventArgs
source: html/e9891bf9-d960-be7b-01dd-b5a5c26fd4f4.htm
---
# DocumentOpeningEventArgs Methods

When the event is cancellable, may call the Cancel() method to cancel it.